       01 RIDER-REC.
           05 RIDER-ID        PIC X(20).
           05 POLICY-ID       PIC X(20).
           05 RIDER-TYPE      PIC X(20).
           05 RIDER-PREMIUM   PIC 9(7)V99.