       01 RIDER-REC.
           05 RIDER-ID        PIC 9(9).
           05 POLICY-ID       PIC 9(9).
           05 RIDER-TYPE      PIC X(50).
           05 RIDER-PREMIUM   PIC 9(9)V99.