IDENTIFICATION DIVISION.
PROGRAM-ID. POLICYSELECT.

DATA DIVISION.

WORKING-STORAGE SECTION.

EXEC SQL INCLUDE SQLCA END-EXEC.

EXEC SQL BEGIN DECLARE SECTION END-EXEC.
01 POLICY-ID        PIC 9(6).
01 CUSTOMER-NAME    PIC X(50).
01 POLICY-TYPE      PIC X(20).
01 PREMIUM          PIC 9(7)V99.
EXEC SQL END DECLARE SECTION END-EXEC.

PROCEDURE DIVISION.

    MOVE 1001 TO POLICY-ID.

    EXEC SQL
        SELECT CUSTOMER_NAME
        INTO :CUSTOMER-NAME
        FROM policy
        WHERE policy_id = :POLICY-ID
    END-EXEC.

    DISPLAY "Customer: " CUSTOMER-NAME.

    STOP RUN.