       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB-CONNECT.

       PROCEDURE DIVISION.

           DISPLAY "DB MODULE LOADED".

           GOBACK.