       IDENTIFICATION DIVISION.
       PROGRAM-ID. POLICYSERVICE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY "../copy/policy.cpy".

       PROCEDURE DIVISION.

           CALL "STANDARDPOLICY".
           CALL "HEALTHPOLICY".

           CALL "POLICYINSERT".

           DISPLAY "POLICY SAVED"

           GOBACK.